// Nepali

jQuery.extend( jQuery.fn.pickadate.defaults, {
    monthsFull: [ 'जनअरी', 'र्े ब्रीवरी', 'मार', 'वसप्रब', 'म', 'जीन', 'जीबाई', 'वगस्त', 'म्े् ेारर', 'वक् ोरर', 'नोभेारर', 'सडम्ेारर' ],
    monthsShort: [ 'जन', 'र्े ब्री', 'मार', 'वसप', 'मे', 'जीन', 'जीब', 'वग', 'म्े्', 'वक् ो', 'नोभ', 'सडम्े' ],
    weekdaysFull: [ 'म्ोमअार', 'मकगबअार', 'रीधअार', 'सरहीअार', 'लीक्रअार', 'लसनअार', 'आइतअार' ],
    weekdaysShort: [ 'म्ोम', 'मकगब', 'रीध', 'सरही', 'लीक्र', 'लसन', 'आइत' ],
    numbers: [ '०', '१', '२', '३', '४', '५', '६', '७', '८', '९' ],
    today: 'आज',
    clear: 'मेटाउनुहोस्',
    format: 'dddd, dd mmmm, yyyy',
    formatSubmit: 'yyyy/mm/dd'
});