webshims.validityMessages.fa = {
    "typeMismatch": {
        "defaultMessage": "خواهشمندیم یک مقدار معتبر وارد نمایید.",
        "email": "خواهشمندیم یک آدرس رایانامه وارد نمایید.",
        "url": "خواهشمندیم یک آدرس اینترنتی وارد نمایید."
    },
    "badInput": {
        "defaultMessage": "خواهشمندیم یک مقدار معتبر وارد نمایید.",
        "number": "خواهشمندیم یک عدد وارد نمایید.",
        "date": "خواهشمندیم یک تاریخ وارد نمایید.",
        "time": "خواهشمندیم یک زمان وارد نمایید.",
        "range": "ورودی نامعتبر.",
        "month": "خواهشمندیم یک مقدار معتبر وارد نمایید.",
        "datetime-local": "خواهشمندیم یک تاریخ-زمان وارد نمایید."
    },
    "rangeUnderflow": {
        "defaultMessage": "مقدار وارده می بایست بزرگتر-مساوی {%min} باشد.",
        "date": "مقدار وارده می بایست برابر {%min} یا بعد تر از آن باشد.",
        "time": "مقدار وارده می بایست برابر {%min} یا بعد تر از آن باشد.",
        "datetime-local": "مقدار وارده می بایست برابر {%min} یا بعد تر از آن باشد.",
        "month": "مقدار وارده می بایست برابر {%min} یا بعد تر از آن باشد."
    },
    "rangeOverflow": {
        "defaultMessage": "مقدار وارده می بایست کوچکتر-مساوی {%max} باشد.",
        "date": "مقدار وارده می بایست برابر {%max} یا قبل تر از آن باشد.",
        "time": "مقدار وارده می بایست برابر {%max} یا قبل تر از آن باشد.",
        "datetime-local": "مقدار وارده می بایست برابر {%max} یا قبل تر از آن باشد.",
        "month": "مقدار وارده می بایست برابر {%max} یا قبل تر از آن باشد."
    },
    "stepMismatch": "ورودی نامعتبر.",
    "tooLong": "خواهشمندیم بیش از {%maxlength} نویسه وارد نکنید. شما {%valueLen} وارد نموده اید.",
    "tooShort": "خواهشمندیم کم تر از {%minlength} نویسه وارد نکنید. شما {%valueLen} وارد نموده اید.",
    "patternMismatch": "ورودی نامعتبر. {%title}",
    "valueMissing": {
        "defaultMessage": "خواهشمندیم این ورودی را پر نمایید.",
        "checkbox": "خواهشمندیم جهت ادامه فعالیت، این ورودی را علامت گذاری نمایید.",
        "select": "خواهشمندیم گزینه ای را انتخاب نمایید.",
        "radio": "خواهشمندیم گزینه ای را انتخاب نمایید."
    }
};
webshims.formcfg.fa = {
    "numberFormat": {
        ".": ".",
        ",": ","
    },
    "numberSigns": ".",
    "dateSigns": "/",
    "timeSigns": ":. ",
    "dFormat": "/",
    "patterns": {
        "d": "yy/mm/dd"
    },
    "meridian": [
		"ب.ظ",
		"ق.ظ"
    ],
    "month": {
        "currentText": "این ماه"
    },
    "time": {
        "currentText": "حال"
    },
    "date": {
        "closeText": "انجام شد",
        "clear": "از نو",
        "prevText": "پیش",
        "nextText": "پس",
        "currentText": "امروز",
        "monthNames": [
            "ژانویه",
            "فوریه",
            "مارس",
            "آوریل",
            "مه",
            "ژوئن",
            "ژوئیه",
            "اوت",
            "سپتامبر",
            "اکتبر",
            "نوابر",
            "دسامبر"
        ],
        "monthNamesShort": [
            "ژانویه",
            "فوریه",
            "مارس",
            "آوریل",
            "مه",
            "ژوئن",
            "ژوئیه",
            "اوت",
            "سپتامبر",
            "اکتبر",
            "نوابر",
            "دسامبر"
        ],
        "dayNames": [
            "یکشنبه",
            "دوشنبه",
            "سه شنبه",
            "چهار شنبه",
            "پنجشنبه",
            "آدینه",
            "شنبه"
        ],
        "dayNamesShort": [
            "ی",
            "د",
            "س",
            "چ",
            "پ",
            "آ",
            "ش"
        ],
        "dayNamesMin": [
            "ی",
            "د",
            "س",
            "چ",
            "پ",
            "آ",
            "ش"
        ],
        "weekHeader": "هفته",
        "firstDay": 6,
        "isRTL": true,
        "showMonthAfterYear": false,
        "yearSuffix": ""
    }
};
