if(!window.calendar_languages) {
	window.calendar_languages = {};
}
window.calendar_languages['el-GR'] = {
	error_noview: 'Ημερολόγιο: Η προβολή {0} δεν βρέθηκε',
	error_dateformat: 'Ημερολόγιο: Η μορφή της ημερομηνίας {0} δεν είναι έγκυρη. Παρακαλώ χρησιμοποιήστε "now" ή "yyyy-mm-dd"',
	error_loadurl: 'Ημερολόγιο: Η διεύθυνση λήψης των event δεν έχει καθοριστεί',
	error_where: 'Ημερολόγιο: Η μορφή κατεύθυνσης {0} δεν είναι έγκυρη. Παρακαλώ χρησιμοποιήστε μία εκ των "next", "prev" και "today"',

	title_year: 'Έτος {0}',
	title_month: '{0} {1}',
	title_week: 'Εβδομάδα {0} του έτους {1}',
	title_day: '{0} {1} {2} {3}',

	week:'Εβδομάδα',

	m0: 'Ιανουάριος',
	m1: 'Φεβρουάριος',
	m2: 'Μάρτιος',
	m3: 'Απρίλιος',
	m4: 'Μάϊος',
	m5: 'Ιούνιος',
	m6: 'Ιούλιος',
	m7: 'Αύγουστος',
	m8: 'Σεπτέμβριος',
	m9: 'Οκτώβριος',
	m10: 'Νοέμβριος',
	m11: 'Δεκέμβριος',

	ms0: 'Ιαν',
	ms1: 'Φεβ',
	ms2: 'Μαρ',
	ms3: 'Απρ',
	ms4: 'Μαϊ',
	ms5: 'Ιουν',
	ms6: 'Ιουλ',
	ms7: 'Αυγ',
	ms8: 'Σεπ',
	ms9: 'Οκτ',
	ms10: 'Νοε',
	ms11: 'Δεκ',

	d0: 'Κυριακή',
	d1: 'Δευτέρα',
	d2: 'Τρίτη',
	d3: 'Τετάρτη',
	d4: 'Πέμπτη',
	d5: 'Παρασκευή',
	d6: 'Σάββατο',

	easter: 'Πάσχα',
	easterMonday: 'Δευτέρα του Πάσχα',

	enable_easter_holidays: true,
	first_day: 2
};